src/cf/Enums/ВидыРБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыРБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсвоениеПриродныхРесурсов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолгосрочноеСтрахованиеЖизни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрахованиеНаОплатуМедицинскихРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрахованиеНаСлучайСмертиИУтратыРаботоспособности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеВидыСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбыткиОтРеализацииАмортизируемогоИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбыткиПрошлыхЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбыткиПрошлыхЛетОбслуживающихПроизводствИХозяйств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыРБП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидРасходов") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Если Параметры.ВидРасходов = "РасходыНаСтрахование" Тогда
			
			ДанныеВыбора.Добавить(ДолгосрочноеСтрахованиеЖизни);
			ДанныеВыбора.Добавить(СтрахованиеНаОплатуМедицинскихРасходов);
			ДанныеВыбора.Добавить(СтрахованиеНаСлучайСмертиИУтратыРаботоспособности);
			ДанныеВыбора.Добавить(ПрочиеВидыСтрахования);
			
		ИначеЕсли Параметры.ВидРасходов = "ПрочиеРасходы" Тогда
			
			ДанныеВыбора.Добавить(ОсвоениеПриродныхРесурсов);
			ДанныеВыбора.Добавить(УбыткиОтРеализацииАмортизируемогоИмущества);
			ДанныеВыбора.Добавить(УбыткиПрошлыхЛет);
			ДанныеВыбора.Добавить(УбыткиПрошлыхЛетОбслуживающихПроизводствИХозяйств);
			ДанныеВыбора.Добавить(Прочие);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
